package oop;

public class OOP {
    // TODO OOP - Объектке багытталган программалоо.
    // Программалоодо объекттерди жана алардын ортосундагы байланыштарды
    // колдонгон методология. OOP негизинен 4 негизги принципке таянат;
    // TODO Object Oriented Programming' тин негизги принциптери:
    // TODO ENCAPSULATION
    // TODO INHERITANCE
    // TODO POLYMORPHISM
    // TODO ABSTRACTION

    // OOP колдонуу артыкчылыктары:
    // -> коддун кайра колдонулушу (reuse)
    // -> тартиптуу жана структураланган код
    // -> колдонуу жана озгортуу оной
    // -> чон программаларды башгарууга ынгайлуу

}
