package object_class;

public class Object {
    // TODO OBJECT
    // БАРДЫК КЛАССТАРДЫН PARENT CLASS' Ы
    // КАНДАЙ КЛАСС ЮОЛЮОСУН БАРДЫГЫН ПО УМОЛЧЕНИЮ МУРАСТАЙТ.

    // Java' да Object – бардык класстардын түпкү (ата) классы.
    // Башкача айтканда, Java' дагы ар бир класс Object классын
    // автоматтык түрдө мурастайт (эгер башка классты мурастабаса).

    // TODO 2️⃣ Object классынын негизги методдору
    // Object классы көптөгөн негизги (common) методдорду камсыз кылат.
    // Бул методдорду башка класстар мурастап, кайра аныктай (override) алышат.
    // Төмөндө Object классынын эң көп колдонулган методдору:
    // TODO Метод;
    // todo toString()
    // Объекттин тексттик көрсөтүлүшүн кайтарат.
    // todo equals(Object obj)
    // Эки объекттин тең экендигин салыштырат.
    // todo hashCode()
    // Объекттин уникалдуу хэш кодун кайтарат.
    // todo getClass()
    // Объекттин классы жөнүндө маалымат берет.
    // todo clone()
    // Объекттин көчүрмөсүн түзөт (shallow copy).
    // todo finalize()
    // Объект жок кылардан мурун чакырылат (Garbage Collection).
    // todo notify(), notifyAll(), wait()
    // Thread синхронизациясы үчүн колдонулат.
}
