package modifier;

public class Main {
    public static void main(String[] args) {
        // TODO Modifiers

        // todo Packages: -> Пакеттерди папкалар деп түшүнсөңүздө болот.
        // todo ? Пакеттер эмне учун керек ?
        // -> Класстар иреттүү туруу үчүн керек.
        // -> Биз жавада бир жерде эки
        // окшош аттуу класс түзө албайбыз,
        //  пакеттер бул көйгөйдү чечет.

        // todo Модификаторы доступа
        // Java класстарга, өзгөрмөлөргө,
        // методдорго жана конструкторлорго
        // кирүү деңгээлдерин аныктоо үчүн бир
        // катар мүмкүндүк модификаторлорун
        // камсыз кылат

        // Java предоставляет ряд модификаторов
        // доступа, чтобы задать уровни доступа
        // для классов, переменных, методов и
        // конструкторов

        // TODO              MODIFIERS
        // todo              /      \
        // todo Access Modifiers  // Non - Access Modifiers
        // -> private             // -> static
        // -> public              // -> final
        // -> default             // -> abstract
        // -> protected           // -> synchronized
        //                        // -> volatile

        // todo Модификаторы доступа


    }
}